//! Q1. 배열에서 최대값과 최소값 찾기
// : 배열 numbers에 있는 숫자들 중 최대값과 최소값을 찾는 코드를 작성
// 예시 배열: let numbers = [3, 9, 7, 5, 1, 8];

//! Q2. 객체에서 특정 값에 해당하는 속성 찾기
// : 객체 person에서 나이가 30인 사람의 이름을 찾는 코드를 작성
// 예시 객체: let person = { "Tom": 25, "Jerry": 30, "Spike": 28 };

//! Q3. 중복 문자 제거하기
// : 주어진 문자열에서 중복된 문자를 제거한 새로운 문자열을 반환하는 함수를 작성
// 예시: 입력 "banana" → 출력 "ban"

//! Q4. 문자열 내의 특정 문자 개수 세기
// : 주어진 문자열에서 특정 문자의 개수를 반환하는 함수를 작성
// 예시: 입력 ("javascript", "a") → 출력 2

//! Q5. 피보나치 수열의 n번째 항을 계산하기
// : 피보나치 수열에서 n번째 숫자를 반환하는 함수를 작성하세요. (0번째는 0, 1번째는 1)
// 예시: 입력 5 → 출력 5 (피보나치 수열: 0, 1, 1, 2, 3, 5)

//? 피보나치 수열
// : 첫 번째와 두 번째 항은 각각 0과 1이다.
// : 그 이후의 모든 항은 바로 앞의 두 항의 합으로 이루어진다.
// 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, ...